.DT
count
Discworld player help
count

.SH Name
.SI 5
count - count how many objects are present
.EI

.SH Syntax
.SI 5
count <things [in <container>]>
count <things> in room
count <things> in inventory
.EI

.SH Description
.SP 5 5
This command lets you tell how many of something you are carrying or
are in your location.  This is useful when there are "many" or "some"
of something present and you want to know exactly how many there are.
.EP

.SH Example
.SI 5
> count frogs
You count twenty-five frogs.

> count frogs in inventory
You count seventeen frogs.

> count frogs in room
You count eight frogs.

> count fish in sack
You count forty-nine fish.
.EI

.SH See also
.SP 5 5
inventory, money
.EP
