.DT
title
Discworld player help
title

.SH Name
.SI 5
title - sets the player title
.EI

.SH Syntax
.SI 5
title
title <title>
title none
.EI

.SH Description
.SP 5 5
This command sets your player title.  The player title is the bit that will
show up before your name, as in Mr Turrican or Miss Wyvyrn.  You can only set
your player title to one title.

Using 'title' by itself will tell you your current title, and the list of
titles available to you.

The 'none' argument sets the title back to nothing.

You can use the 'brief names' command to stop titles from being displayed
by people.
.EP

.SH Examples
.SI 5
> title
Your player title is currently not set.
You can set your player title to one of Mr, Miss, Mrs and Ms.

> title mr
You set your player title to Mr.

> title miss
You set your player title to Miss.

> title none
You reset your player title.
.EI

.SH See also
.SP 5 5
brief
.EP
